---
kind: other
id: Properties.T:Autodesk.Revit.DB.BuiltInFailures.SiteFailures
source: html/39ef4f44-7307-c223-6579-368522b580f2.htm
---
# BuiltInFailures.SiteFailures Properties

Can't create a single Pad with several connected regions.